
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/15358612320)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.update-license-year.github_actions_repository_permissions.this
  * module.update-license-year.github_branch_default.this
  * module.update-license-year.github_branch_protection.this[&#34;main&#34;]
  * module.update-license-year.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.update-license-year.github_actions_repository_permissions.this will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "update-license-year"
    }

  # module.update-license-year.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "update-license-year"
    }

  # module.update-license-year.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "update-license-year"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # module.update-license-year.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Automatically update license year in repositories."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "update-license-year"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "license",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1267,"Program":"tfcmt","SHA1":"71bdfae3e762a8c6cce9d5e01603b7dd108b158a","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->